#### OrdinateTextPosition Enumeration

---

|  |
| --- |
| See Also |

The ordinate dimension text position.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2017 Subscription Update
  **Since:**  2017 Subscription Update

# Syntax

| C# |
| --- |
| ``` public enum OrdinateTextPosition ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration OrdinateTextPosition ``` |

| Visual C++ |
| --- |
| ``` public enum class OrdinateTextPosition ``` |

# Members

| Member name | Description |
| --- | --- |
| EndOfWitnessLine | The dimension text position will be at the end of witness line. |
| NextToWitnessLine | The dimension text position will be next to witness line. |

# See Also

Autodesk.Revit.DB Namespace